000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ГрупповоеДобавлениеРекламныхматералов/ГрупповоеДобавлениеРекламныхматералов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрупповоеДобавлениеРекламныхматералов</name>
</mdclass:DataProcessor>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ОрганизацииПодразделений/ОрганизацииПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОрганизацииПодразделений</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Владелец</name>
    <comment>Элемент справочника, периодичность реквизита которого мы обеспечиваем.</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.Магазины</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Documents/РаспоряжениеНаПриемку/РаспоряжениеНаПриемку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РаспоряжениеНаПриемку</name>
  <registerRecords>InformationRegister.РекламныеМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.РекламныеМатериалыКПриемке</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетПриемки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиРекламныхМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РекламныеМатериалы</name>
    <attributes>
      <name>РекламныйМатериал</name>
      <type>
        <types>CatalogRef.РекламныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>РекламнаяПлоскость</name>
      <type>
        <types>CatalogRef.РекламныеПлоскости</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЗаКВМ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>CatalogRef.РазмещениеРекламныхМатериалов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация_У</name>
    <comment>Основная организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/DataProcessors/ГрупповоеДобавлениеРекламныхматералов/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
 	Организация = ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация;
 	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьМагазины();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьМагазины()

	Магазины.Очистить();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Магазины.Ссылка КАК Магазин,
	|	ИСТИНА КАК Выбран
	|ИЗ
	|	РегистрСведений.ОрганизацииПодразделений.СрезПоследних(&Период, ) КАК ТаблицаОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Магазины КАК Магазины
	|		ПО ТаблицаОрганизаций.Владелец = Магазины.Ссылка
	|ГДЕ
	|	ТаблицаОрганизаций.Организация = &Организация
	|	И Магазины.ВведенВЭксплуатацию = ИСТИНА
	|	И НЕ(Магазины.Блокирован
	|				ИЛИ Магазины.ПометкаУдаления)"
	);
	Запрос.УстановитьПараметр("Период"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Организация"	, Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Магазины.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Если РекламныеМатериалы.Количество() = 0 тогда 
		Сообщить("Заполните рекламные материалы");
		Успешно = Ложь;
	Иначе
		Успешно = Истина;
		Для Каждого Строка из Магазины цикл
			Если Строка.Выбран тогда
				Док 					= Документы.РаспоряжениеНаПриемку.СоздатьДокумент();
				Док.Дата 				= ТекущаяДата();
				Док.Ответственный 		= Ответственный;
				Док.Поставщик			= Поставщик;
				Док.ДатаС 				= ДатаС;
				Док.ДатаПо 				= ДатаПо;
				Док.Магазин 			= Строка.Магазин;
				Док.НеТребуетПриемки 	= НеТребуетПриемки;
				Док.Комментарий         = Комментарий;
				Док.Организация			= ОбщегоНазначенияРТ.ПолучитьУчетнуюПолитику().ОсновнаяОрганизация;
				Док.РекламныеМатериалы.Загрузить(РекламныеМатериалы.Выгрузить());
				Док.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Успешно;	
КонецФункции

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	Если	СоздатьДокументыНаСервере()  тогда
		Сообщить("Документы созданы успешно!");
		//РекламныеМатериалы.Очистить();
	КонецЕсли;
	Для Каждого Строка из Магазины Цикл
		Строка.Выбран = Ложь;
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаСПриИзменении(Элемент)
	РасчитатьКоличествоДней()   
КонецПроцедуры


&НаКлиенте
Процедура РасчитатьКоличествоДней()
	Если ЗначениеЗаполнено(ДатаС) и  ЗначениеЗаполнено(ДатаПо) тогда		
		КоличествоДней = (ДатаПо - ДатаС)/(24*60*60)+1;
	Иначе
		КоличествоДней = 0;
	КонецЕсли;
	ПересчитатьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПересчитатьНаСервере()
	Для Каждого Строка из РекламныеМатериалы цикл
		Строка.Цена = Цена;
		Строка.Сумма = Строка.Количество * Строка.Цена * КоличествоДней;		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоПриИзменении(Элемент)
	РасчитатьКоличествоДней()   
КонецПроцедуры

&НаКлиенте
Процедура РекламныеМатериалыКоличествоПриИзменении(Элемент)
	ТекДанные 		= Элементы.РекламныеМатериалы.ТекущиеДанные;
	ТекДанные.Сумма =  ТекДанные.Количество*Цена*КоличествоДней;
	Текданные.Цена 	= Цена;
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	ЦенаЗапериод = Цена*КоличествоДней; 	
	ПересчитатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура флДа(Команда)
	Для Каждого Строка из Магазины Цикл
		Строка.Выбран = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура флНет(Команда)
	Для Каждого Строка из Магазины Цикл
		Строка.Выбран = Ложь;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура ЦенаЗапериодПриИзменении(Элемент)
	Если ЗначениеЗаполнено(КоличествоДней) тогда 
		Цена = ЦенаЗапериод/КоличествоДней;
		ПересчитатьНаСервере();
	КонецЕсли;
КонецПроцедуры
